Revit 2024 API
AnalysisDisplayColoredSurfaceSettings Constructor
 Constructs a default instance of colored surface settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AnalysisDisplayColoredSurfaceSettings()
Visual Basic
Public Sub New
Visual C++
public:
AnalysisDisplayColoredSurfaceSettings()
See Also
AnalysisDisplayColoredSurfaceSettings Class
AnalysisDisplayColoredSurfaceSettings Overload
Autodesk.Revit.DB.Analysis Namespace